app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "name" = 'New Name', "email" = 'new@example.com', "password_digest" = '$2a$04$GaPKUmcbNK3yO4fUNMu22O8h3hXx8U1Ux/Vfi3mYzWAeLxmKXkGLu', "remember_token" = 'hKLDHKrkO2JKMBj8uELagA', "updated_at" = '2012-12-07 08:33:30.272405' WHERE "users"."id" = 1